<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
	<meta http-equiv="content-type" content="text/html; charset=iso-8859-1"/>
	<title>class Mentions</title>
	<link type="text/css" rel="stylesheet" href="$resources/style.css"/>
	<script type="text/javascript" language="javascript" src="$resources/treeview.js"></script>
</head>
<body onload="toggler.setupTreeView('MainList');toggler.backToMemorizedState('MainList', 'btnToggle')">
	<ul class="navig">
	<li><a href="javascript:toggler.toggleAll('MainList', 'btnToggle')" class="expandAllBtn" id="btnToggle">Expand all</a></li><li><a href="help.htm" class="helpBtn">Help</a></li><li><a href="index-all.htm" class="indexAllBtn">Index</a></li><li><a href="class-Modifier_Recettes.htm" class="left">Prev class</a></li><li><a href="package-summary.htm" class="top">Package</a></li><li><a href="class-Nouvelle_Recette.htm" class="right">Next class</a></li>
	</ul>
	<h1 class="class">Mentions</h1>
	<div id="MainList">
	<div class="description"><p>Class <span class="title">Mentions</span> extends <a href="class-VueCacheable.htm" class="link2">VueCacheable</a></p><ul class="description"><li>File: vues/Mentions.php</li></ul></div><dl class="inheritTree"><dd style="padding-left:-15px"><a href="class-Vue.htm" class="link2">Vue</a></dd><dd style="padding-left:6px"><img src="$resources/inherit.gif" alt="extended by "/><a href="class-VueCacheable.htm" class="link2">VueCacheable</a></dd><dd style="padding-left:45px" class="current"><img src="$resources/inherit.gif" alt="extended by "/>Mentions</dd></dl><h2>Properties</h2><ul class="summary"><li class="Collapsed" id="cache"><a href="javascript:void(0);" class="property-pro" target="main">$cache</a><ul class="description"><li>Protected static <a href="datatype-string.htm" class="link">string</a> <span class="smallTitle">$cache</span><span class="defVal"> = &#039;
&lt;div id=&quot;tache-1&quot;&gt;

&lt;h1&gt;Le N&eacute;phaliste&lt;/h1&gt;
&lt;blockquote&gt;
	&lt;cite class=&quot;fr&quot;&gt;Awesome!!1!&lt;/cite&gt; (The Internets, 2010)&lt;br/&gt;
	&lt;cite class=&quot;fr&quot;&gt;Best site of the year&lt;/cite&gt; (Bruno Cauet, &lt;em&gt;in&lt;/em&gt; self-interview, 2010)&lt;br/&gt;
	&lt;cite class=&quot;fr&quot;&gt;J\&#039;ai faim&nbsp;!&lt;/cite&gt; (Jocelyn Caulet, &lt;em&gt;in&lt;/em&gt; D&eacute;fonc&eacute; n&deg;32 &mdash; mai 2010)&lt;br/&gt;
	&lt;cite class=&quot;fr&quot;&gt;C\&#039;est bon, je fermerai.&lt;/cite&gt; (Fran&ccedil;ois Savary, 2009-2010)&lt;br/&gt;
	
&lt;/blockquote&gt;



&lt;p&gt;&lt;a href=&quot;http://fr.wiktionary.org/wiki/n&eacute;phaliste&quot;&gt;&laquo;&nbsp;Le N&eacute;phaliste&nbsp;&raquo;&lt;/a&gt; est une application web programm&eacute;e par &lt;a href=&quot;mailto:brunocauet@gmail.com&quot;&gt;Bruno Cauet&lt;/a&gt; pour &lt;a href=&quot;http://coo.pe&quot;&gt;la Coop&eacute;&lt;/a&gt; de Sup&eacute;lec.&lt;br /&gt;
Son utilisation est soumise &agrave; la licence &lt;a href=&quot;http://creativecommons.org/licenses/by-nc-sa/2.0/fr/&quot;&gt;CC-by-nc-sa&lt;/a&gt;.
Le code source est disponible sur demande.&lt;/p&gt;

&lt;h1 style=&quot;margin-top: 5em;&quot;&gt;Mode d\&#039;emploi&lt;/h1&gt;

&lt;dl id=&quot;mentions&quot;&gt;
	&lt;dt&gt;Auto-compl&eacute;tion&lt;/dt&gt;
	&lt;dd&gt;Lorsqu\&#039;il faut pr&eacute;ciser un compte d\&#039;utilisateur, il n\&#039;y a pas &agrave; le chercher dans une (tr&egrave;s longue) liste d&eacute;roulante : taper, dans le champ texte, au moins trois caract&egrave;res de son pr&eacute;nom, surnom ou nom suffit &agrave; rendre une pseudo-liste d&eacute;roulante offrant diff&eacute;rentes propositions.&lt;/dd&gt;
	
	&lt;dt&gt;Interface pour attard&eacute;s mentaux&lt;/dt&gt;
	&lt;dd&gt;Un Coop&eacute;man go&ucirc;tant la bi&egrave;re qu\&#039;il sert, il arrive, en fin de soir&eacute;e, que celui-ci accumule les grammes &lt;del&gt;de sang dans l\&#039;alcool&lt;/del&gt; &lt;ins&gt;d\&#039;alcool dans le sang&lt;/ins&gt;. Pour pr&eacute;venir les d&eacute;boires cons&eacute;quents &agrave; son &eacute;tat (&laquo;&nbsp;bin, je dois cliquer o&ugrave; d&eacute;j&agrave; ?&nbsp;&raquo;), les menus sont en &lt;strong&gt;gras&lt;/strong&gt; et en &lt;span style=&quot;color: red;&quot;&gt;c&lt;/span&gt;&lt;span style=&quot;color: green;&quot;&gt;o&lt;/span&gt;&lt;span style=&quot;color: yellow;&quot;&gt;u&lt;/span&gt;&lt;span style=&quot;color: purple;&quot;&gt;l&lt;/span&gt;&lt;span style=&quot;color: teal;&quot;&gt;e&lt;/span&gt;&lt;span style=&quot;color: blue;&quot;&gt;u&lt;/span&gt;&lt;span style=&quot;color: magenta;&quot;&gt;r&lt;/span&gt;.&lt;/dd&gt;
	&lt;dd&gt;De plus, les principales fonctionnalit&eacute;s sont accessibles sur une seule page, en deux clics. Le syndrome de j\&#039;ai-la-femme-de-d&eacute;biter devrait donc dispara&icirc;tre.&lt;/dd&gt;
	
	&lt;dt&gt;D&eacute;bit&lt;/dt&gt;
	&lt;dd&gt;Il y a vraiment besoin d\&#039;expliquer comment &ccedil;a fonctionne ?&lt;/dd&gt;
	
	&lt;dt&gt;Cr&eacute;dit&lt;/dt&gt;
	&lt;dd&gt;M&ecirc;me remarque.&lt;/dd&gt;
	&lt;dd&gt;Ah si, quand m&ecirc;me : on peut cr&eacute;diter d\&#039;un montant n&eacute;gatif. Ca servira peut-&ecirc;tre un jour.&lt;/dd&gt;
	
	&lt;dt&gt;Recherche de compte&lt;/dt&gt;
	&lt;dd&gt;Permet d\&#039;avoir des informations sur un compte : derniers d&eacute;p&ocirc;ts d\&#039;argent, derniers d&eacute;bit, solde, etc. Les vingt derni&egrave;res transactions sont marqu&eacute;es dans l\&#039;historiques, mais elles sont en fait TOUTES pr&eacute;sentes dans la base de donn&eacute;es, si besoin.&lt;/dd&gt;
	&lt;dd&gt;Donne &eacute;galement acc&egrave;s &agrave; la liste de tous les comptes (ah, faut d\&#039;ailleurs je donne la possibilit&eacute; de filtrer (par ann&eacute;e etc.)). Remarquez le superbe d&eacute;grad&eacute; sur les soldes (faudrait faire la m&ecirc;me avec les cautions !). En cliquant sur la roue avec un crayon (????), on peut imm&eacute;diatement modifier un compte. Il faut ensuite cliquer sur l\&#039;ic&ocirc;ne de validation pour que les modifications soient prises en compte.&lt;/dd&gt;
	
	&lt;dt&gt;Cr&eacute;ation de compte&lt;/dt&gt;
	&lt;dd&gt;A la suite du menu pr&eacute;c&eacute;dent se trouve celui, violet, de cr&eacute;ation/modification de compte. Il n\&#039;y a pas grand-chose &agrave; dire.&lt;/dd&gt;
	&lt;dd&gt;La caution se fait sous forme d\&#039;un ch&egrave;que de 25 euros. Sans elle, un compte ne peut pas aller dans le n&eacute;gatif. Avec, on peut descendre &agrave; -25 euros. Attention ! &Ecirc;tre dans le n&eacute;gatif trop longtemps entra&icirc;ne des mails de pourrissage puis l\&#039;encaissement du ch&egrave;que.&lt;/dd&gt;
	
	&lt;dt&gt;Gestion&lt;/dt&gt;
	&lt;dd&gt;La gestion a r&eacute;cemment (fin 2010) &eacute;t&eacute; simplifi&eacute;e. Le c&ocirc;t&eacute; gestion de stocks a enti&egrave;rement disparu (et c\&#039;est con, parce que cette partie du manuel &eacute;tait bond&eacute;e d\&#039;humour).&lt;/dd&gt;
	&lt;dd&gt;Passons donc au turquoise (han cyan oui je sais, c\&#039;est MOI qui ai fait le site) : La premi&egrave;re partie s\&#039;occupe de ce que la &lt;acronym title=&quot;awesum&quot;&gt;Coop&eacute;&lt;/acronym&gt; vend : les recettes. (Pour citer &lt;acronym title=&quot;&laquo; prince de la nuit et des angoisses &raquo;&quot;&gt;Lou Reed&lt;/acronym&gt;, &lt;cite class=&quot;us&quot;&gt;Take a walk on the wild side&lt;/cite&gt;). Une recette poss&egrave;de un nom, un prix. Simple. Le second lien permet de modifier les recettes pr&eacute;c&eacute;dentes &ndash; en particulier leur visibilit&eacute; : si un produit n\&#039;est plus en vente (rupture de stock, ou vendu lors d\&#039;une soir&eacute;e particuli&egrave;re), le cacher suffit jusqu\&#039;&agrave; ce que la Coop&eacute; le propose &agrave; nouveau.&lt;/dd&gt;
	&lt;dd&gt;Attaquons-nous aux autres liens : vous trouvez ensuite un &laquo; Derni&egrave;res consommations &raquo;. Un clic et vous est pr&eacute;sent&eacute;e la liste des 30 derni&egrave;res commandes, avec possibilit&eacute; de suppression en cas d\&#039;erreur (&lt;strong&gt;OMG&lt;/strong&gt;, &lt;em&gt;so&lt;/em&gt; badass).&lt;/dd&gt;
	&lt;dd&gt;Vous trouverez &eacute;galement un lien vers cette page, mais si vous y &ecirc;tes d&eacute;j&agrave;, donc je pense que vous vous &ecirc;tes d&eacute;brouill&eacute; seul. Toutes mes f&eacute;licitations.&lt;/dd&gt;
	&lt;dd&gt;Il s\&#039;y trouve &eacute;galement le lien vers l\&#039;interface d\&#039;administration, qui permet diff&eacute;rents r&eacute;glages concernant l\&#039;application. La description suit.&lt;/dd&gt;
	&lt;dd&gt;Enfin, un lien m&egrave;ne &agrave; la version minimaliste du site, destin&eacute;e aux smartphones. Pour la quitter, il suffit de cliquer sur &laquo; &Eacute;cran principal &raquo;.&lt;/dd&gt;
	
	
	
	
	&lt;dt&gt;Administration&lt;/dt&gt;
	&lt;dd&gt;Vous pouvez r&eacute;gler la promotion en cours &agrave; Sup&eacute;lec. Elle modifie les dates accessibles pour la cr&eacute;ation de compte.&lt;/dd&gt;
	&lt;dd&gt;Le trez peut d&eacute;clarer les d&eacute;p&ocirc;ts aupr&egrave;s de la banque.&lt;/dd&gt;
	&lt;dd&gt;Il y a un lien vers la page de gestion de cl&ocirc;ture de comptes. Cette fonctionnalit&eacute; est d&eacute;crite juste apr&egrave;s.&lt;/dd&gt;
	&lt;dd&gt;On peut r&eacute;g&eacute;n&eacute;rer le cache des pages HTML (et comme me le disait Pete l\&#039;autre jour, &lt;cite class=&quot;uk&quot;&gt;Such an underground feature is really awesome, I &lt;strong&gt;have&lt;/strong&gt; to put it in my next &lt;del&gt;album&lt;/del&gt; &lt;ins&gt;piece of Art&lt;/ins&gt;&lt;/cite&gt;). Vous n\&#039;avez &lt;em&gt;normalement&lt;/em&gt; pas &agrave; y toucher.&lt;/dd&gt;
	&lt;dd&gt;La cl&ocirc;ture des comptes permet de purger la liste des comptes et les propositions d\&#039;auto-compl&eacute;tion. Elle est cependant normalement rarement utilis&eacute;e : &agrave; chaque nouvelle ann&eacute;e &agrave; peu pr&egrave;s... (et quand un vieux vieux revient)&lt;/dd&gt;
	&lt;dd&gt;Un premier r&eacute;glage &ndash; le principal &ndash; permet de r&eacute;gler le nombre d\&#039;ann&eacute;es &agrave; laisser ouvertes. Cela influe sur le choix de la promo &agrave; la cr&eacute;ation, conjointement avec la promotion en cours (page d\&#039;administration).&lt;/dd&gt;
	&lt;dd&gt;Il est possible de choisir de laisser les comptes en n&eacute;gatif ouverts ou de les fermer, si tout espoir de remboursement a disparu.&lt;/dd&gt;
	&lt;dd&gt;De plus, on peut choisir de laisser le compte d\&#039;une certaine personne ouvert (ex : redoublant encore l&agrave; alors que sa promo est partie, mec qui doit trop d\&#039;argent &agrave; la Coop&eacute;, etc.).&lt;/dd&gt;
	
	&lt;dt&gt;Les statistiques&lt;/dt&gt;
	&lt;dd&gt;Putain, tant de fonctionnalit&eacute;s ! Dans une seule page ! On n\&#039;y croyait pas&hellip; Enfin, les stats. Demandeuses en ressources, elles sont mises &agrave; jour toutes les &lt;acronym title=&quot;24h&quot;&gt;vingt-quatre heures&lt;/acronym&gt;.&lt;/dd&gt;
	&lt;dd&gt;&lt;strong&gt;Attention !&lt;/strong&gt; Les comptes affich&eacute;s repr&eacute;sentent l\&#039;&eacute;quilibre financier, et pas l\&#039;&eacute;quilibre comptable. Ils ne remplacent donc pas Maze.&lt;/dd&gt;


	&lt;dt&gt;Autres&lt;/dt&gt;
	&lt;dd&gt;Un superbe bouton &laquo;&nbsp;retour &agrave; l\&#039;accueil&nbsp;&raquo; si vous &ecirc;tes perdu, pour revenir &agrave; l\&#039;accueil en toute simplicit&eacute;, et y attendre maman. Je crois que je vais le breveter et le vendre aux supermarch&eacute;s.&lt;/dd&gt;
	&lt;dd&gt;Les mec qui a fait cet outil cherche une copine.&lt;/dd&gt;
	&lt;dd&gt;Le truc n\&#039;est pas fini. Merci de chercher les bugs et d\&#039;envoyer une description pr&eacute;cise de comment vous avez fait.&lt;/dd&gt;
	&lt;dd&gt;N\&#039;h&eacute;sitez pas &agrave; d&eacute;biter des bi&egrave;res suppl&eacute;mentaires aux gens que vous n\&#039;aimez pas, c\&#039;est bon pour la Coop&eacute;.&lt;/dd&gt;
	&lt;dd&gt;Si un pauvre veut consommer, bin il peut pas.&lt;/dd&gt;
	&lt;dd&gt;&lt;cite class=&quot;fr&quot;&gt;Mais mais mais, pourquoi &ldquo;Le N&eacute;phaliste&rdquo; ?&lt;/cite&gt; cf. lien en haut de la page.&lt;/dd&gt;
	&lt;dd&gt;Vous aurez peut-&ecirc;tre remarqu&eacute; que les guillements pour entourer les citations de Pete Doherty et de Lou Reed sont diff&eacute;rents. Normal, l\&#039;un est Anglais, donc guillements anglais ; l\&#039;autre est am&eacute;ricain, donc guillements am&eacute;ricains.&lt;/dd&gt;
	&lt;dd&gt;Oui, &agrave; un moment le style d\&#039;&eacute;criture change pas mal. J\&#039;ai fait la premi&egrave;re patie un jour, la seconde un autre ; et je n\&#039;avais pas la m&ecirc;me humeur.&lt;/dd&gt;
&lt;/dl&gt;
&lt;/div&gt;
&#039;</span></li></ul></li></ul><h2>Functions</h2><ul class="summary"><li class="Collapsed" id="f4d84dc67a6955"><a href="javascript:void(0);" class="method-pub" target="main">fraiche</a>()<ul class="description"><li>Public <a href="datatype-void.htm" class="link">void</a> <span class="smallTitle">fraiche</span>()</li></ul></li></ul>
	</div>
	<div id="footer">Documentation generated on Mar 19, 2011, 17:40:07 +0100 by <a href="http://pear.php.net/package/PHP_UML/" target="_new">PHP_UML</a></div>
</body>
</html>